app/views/public/comments/_comment.html.erb

SELECT "recipe_comments".* FROM "recipe_comments" WHERE "recipe_comments"."recipe_id" = ?  [["recipe_id", 1]]
SELECT COUNT(*) FROM "recipe_comments" WHERE "recipe_comments"."recipe_id" = ?  [["recipe_id", 1]]
---
  <div class="col">
    <p>コメント件数：<%= recipe.recipe_comments.count %>　　</p>
      <% recipe.recipe_comments.each do |recipe_comment| %>