app/controllers/public/comments_controller.rb

  def create
    @recipe = Recipe.find(params[:recipe_id])
    @comment = current_customer.recipe_comments.new(recipe_comment_params)
    @comment.recipe_id = @recipe.id
    if @comment.save
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "recipe_comments" ("comment", "customer_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "コメント１"], ["customer_id", 1], ["recipe_id", 1], ["created_at", "2022-06-13 16:54:49.868709"], ["updated_at", "2022-06-13 16:54:49.868709"]]

  def destroy
    @recipe = Recipe.find(params[:recipe_id])
    RecipeComment.find(params[:id]).destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipe_comments" WHERE "recipe_comments"."id" = ?  [["id", 2]]
SELECT "recipe_comments".* FROM "recipe_comments" WHERE "recipe_comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]