app/controllers/public/customers_controller.rb

  def show
    @customers = Customer.all
    @customer = Customer.find(current_customer.id)
    @recipes = @customer.recipes
    @recipes = @recipes.page(params[:page]).per(10)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."customer_id" = ? LIMIT ?  [["customer_id", 1], ["LIMIT", 11]]

  def edit
    @customer = Customer.find(current_customer.id)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @customer = Customer.find(current_customer.id)
    @customer.update(customer_params)
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? ORDER BY "customers"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "customers" SET "updated_at" = ? WHERE "customers"."id" = ?  [["updated_at", "2022-06-15 13:37:08.925089"], ["id", 3]]