app/controllers/public/favorites_controller.rb

  def create
    recipe = Recipe.find(params[:recipe_id])
    favorite = current_customer.favorites.new(recipe_id: recipe.id)
    favorite.save
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("customer_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["customer_id", 2], ["recipe_id", 1], ["created_at", "2022-06-14 05:34:34.003092"], ["updated_at", "2022-06-14 05:34:34.003092"]]

  def destroy
    recipe = Recipe.find(params[:recipe_id])
    favorite = current_customer.favorites.find_by(recipe_id: recipe.id)
    favorite.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."customer_id" = ? AND "favorites"."recipe_id" = ? LIMIT ?  [["customer_id", 2], ["recipe_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]