app/controllers/public/homes_controller.rb

  def top
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"