app/views/public/favorites/_iine.html.erb

        <% if current_customer == recipe.customer %>
          ♡<%= recipe.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."recipe_id" = ?  [["recipe_id", 1]]

            <%= link_to recipe_favorites_path(recipe), method: :delete do %>
              ♥<%= recipe.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."recipe_id" = ?  [["recipe_id", 1]]

            <%= link_to recipe_favorites_path(recipe), method: :post do %>
              ♡<%= recipe.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."recipe_id" = ?  [["recipe_id", 1]]